In [1]:
import pandas as pd

In [2]:
budget = pd.read_csv('/home/dan/Documents/Data Science Course Docs/smu-dal-data-pt-09-2021-u-c-master/02-Homework/03-Python/Instructions/PyBank/Resources/budget_data.csv')
election = pd.read_csv('/home/dan/Documents/Data Science Course Docs/smu-dal-data-pt-09-2021-u-c-master/02-Homework/03-Python/Instructions/PyPoll/Resources/election_data.csv')

In [11]:
budget.tail()

    Profit/Losses Month  Year
81         102685   Oct  2016
82         795914   Nov  2016
83          60988   Dec  2016
84         138230   Jan  2017
85         671099   Feb  2017

In [4]:
election

         Voter ID County Candidate
0        12864552  Marsh      Khan
1        17444633  Marsh    Correy
2        19330107  Marsh      Khan
3        19865775  Queen      Khan
4        11927875  Marsh      Khan
...           ...    ...       ...
3520996  18050509  Marsh      Khan
3520997  13060332  Marsh      Khan
3520998  16754708  Queen      Khan
3520999  12083146  Queen      Khan
3521000  14526187  Queen  O'Tooley

[3521001 rows x 3 columns]

In [5]:
#Split the columns for the Month and Year
budget[['Month','Year']] = budget['Date'].str.split('-', expand=True)

In [6]:
#Droping Date column since we split it into two columns
budget.drop('Date', axis = 'columns', inplace = True)

In [7]:
#Total number of Months
budget['Month'].count()

86

##### They're 86 months in the dataset

In [8]:
budget['Profit/Losses'].sum()

38382578

##### The total Net profit is 38,382,578

In [15]:
budget['Profit/Losses']

0     867884
1     984655
2     322013
3     -69417
4     310503
       ...
81    102685
82    795914
83     60988
84    138230
85    671099
Name: Profit/Losses, Length: 86, dtype: int64

##### The average change is 446,309.04

In [21]:
#Largest increase

profit = budget['Profit/Losses']

max_diff = max( [profit[i+1]-profit[i] for i in range(len(profit)-1) if profit[i]<profit[i+1]] )

print(max_diff)

1926159

##### Greatest Increase in Profits: Feb-2012 $1,926,159

In [28]:
min_diff = min( [profit[i+1]-profit[i] for i in range(len(profit)-1) if profit[i]>profit[i+1]] )

print(min_diff)

-2196167

##### Greatest Decrease in Profits: Sep-2013 $-2,196,167

## Election Results

In [29]:
election.head()

   Voter ID County Candidate
0  12864552  Marsh      Khan
1  17444633  Marsh    Correy
2  19330107  Marsh      Khan
3  19865775  Queen      Khan
4  11927875  Marsh      Khan

In [30]:
election['Voter ID'].nunique()

3521001

##### Total Votes: 3,521,001

In [34]:
election['Candidate'].value_counts()

Khan        2218231
Correy       704200
Li           492940
O'Tooley     105630
Name: Candidate, dtype: int64

#### Winner Khan